Connected to Dynamips VM "R1" (ID 1, type c3600) - Console port
Press ENTER to get the prompt.
                 up      
FastEthernet1/0            unassigned      YES NVRAM  up                    up      
FastEthernet2/0            unassigned      YES NVRAM  up                    up      
FastEthernet3/0            unassigned      YES NVRAM  ********istratively down down    
R1#PING    ping 10.10.10.1

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.10.10.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms
R1#ping 10.10.10.1 0. 20.0.8

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.10.20.8, timeout is 2 seconds:
.....
Success rate is 0 percent (0/5)
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#router ospf 1
R1(config-router)#router-id 1.1.1.1
R1(config-router)#network 10.10.10.0 0.0.0.255 area 0
R1(config-router)#end
R1#wr
Building configuration...
[OK]
R1#wrconf t
*Mar  1 00:24:51.399: %SYS-5-CONFIG_I: Configured from console by console
R1#conf tping 10.10.20.810.1show ip interface briefping 10.10.10.1        20.8conf t         wr    conf tping 10.10.20.810.1show ip interface briefroute ospf     interface briefroute ospf     

R1#show ip route ospf

R1#show ip ospf neighbor

Neighbor ID     Pri   State           Dead Time   Address         Interface
2.2.2.2           1   2WAY/DROTHER    00:00:37    10.10.10.2      FastEthernet0/0
3.3.3.3           1   2WAY/DROTHER    00:00:37    10.10.10.3      FastEthernet0/0
4.4.4.4           1   2WAY/DROTHER    00:00:37    10.10.10.4      FastEthernet0/0
5.5.5.5           1   FULL/BDR        00:00:38    10.10.10.5      FastEthernet0/0
6.6.6.6           1   FULL/DR         00:00:38    10.10.10.6      FastEthernet0/0
R1#show ip ospf neighbor

Neighbor ID     Pri   State           Dead Time   Address         Interface
2.2.2.2           1   2WAY/DROTHER    00:00:31    10.10.10.2      FastEthernet0/0
3.3.3.3           1   2WAY/DROTHER    00:00:31    10.10.10.3      FastEthernet0/0
4.4.4.4           1   2WAY/DROTHER    00:00:31    10.10.10.4      FastEthernet0/0
5.5.5.5           1   FULL/BDR        00:00:35    10.10.10.5      FastEthernet0/0
6.6.6.6           1   FULL/DR         00:00:32    10.10.10.6      FastEthernet0/0
7.7.7.7           1   2WAY/DROTHER    00:00:31    10.10.10.7      FastEthernet0/0
R1#
R1#terminal width 511
R1#terminal length 0
R1#
R1#
R1#
R1#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#
R1(config)#interface FastEthernet0/0
R1(config-if)#ip address 10.10.10.1 255.255.255.0
R1(config-if)#no shutdown
R1(config-if)#exit
R1(config)#
R1(config)#end
R1#
R1#
R1#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#
R1(config)#router ospf 1
R1(config-router)#router-id 10.10.10.1
Reload or use "clear ip ospf process" command, for this to take effect
R1(config-router)#network 10.10.10.0 0.0.0.255 area 0
R1(config-router)#network 10.10.20.0 0.0.0.255 area 0
R1(config-router)#exit
R1(config)#
R1(config)#
R1(config)#
R1(config)#write mem
             ^
% Invalid input detected at '^' marker.

R1(config)#
R1(config)#show running-config
             ^
% Invalid input detected at '^' marker.

R1(config)#
R1(config)#show ip ospf neighbor
             ^
% Invalid input detected at '^' marker.

R1(config)#
R1(config)#show ip route ospf
             ^
% Invalid input detected at '^' marker.

R1(config)#
R1(config)#
R1(config)#end
R1#
R1#
*Mar  1 01:21:34.895: %SYS-5-CONFIG_I: Configured from console by console
R1#exit





























































R1 con0 is now available





Press RETURN to get started.






*Mar  1 01:21:36.839: %SYS-5-CONFIG_I: Configured from console by console
R1#terminal width 511
R1#terminal length 0
R1#
R1#
R1#terminal length 0
R1#terminal width 0
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#router ospf 1
R1(config-router)#router-id 1.1.1.1
R1(config-router)#network 10.10.10.0 0.0.0.255 area 0
R1(config-router)#end
R1#
*Mar  1 01:26:15.047: %SYS-5-CONFIG_I: Configured from console by console
R1#wr mem
Building configuration...
[OK]
R1#show clock
*01:26:23.783 UTC Fri Mar 1 2002
R1#show running-config
Building configuration...

Current configuration : 1273 bytes
!
version 12.4
service timestamps debug datetime msec
service timestamps log datetime msec
no service password-encryption
!
hostname R1
!
boot-start-marker
boot-end-marker
!
!
no aaa new-model
memory-size iomem 5
no ip icmp rate-limit unreachable
!
!
ip cef
no ip domain lookup
ip domain name lab.local
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
username ******** privilege 15 secret 5 $1$t4vg$eS99GV0XEQ14fa2Fzv9F7.
!
!
ip tcp synwait-time 5
ip ssh version 2
! 
!
!
!
!
interface FastEthernet0/0
 ip address 10.10.10.1 255.255.255.0
 duplex auto
 speed auto
!
interface FastEthernet1/0
 no ip address
 duplex auto
 speed auto
!
interface FastEthernet2/0
 no ip address
 duplex auto
 speed auto
!
interface FastEthernet3/0
 no ip address
 shutdown
 duplex auto
 speed auto
!
router ospf 1
 router-id 1.1.1.1
 log-adjacency-changes
 network 10.0.1.28 0.0.0.3 area 0
 network 10.0.1.32 0.0.0.3 area 0
 network 10.10.10.0 0.0.0.255 area 0
 network 10.10.20.0 0.0.0.255 area 0
!
no ip http server
no ip http secure-server
!
!
!
no cdp log mismatch duplex
!
!
!
control-plane
!
!
!
!
!
!
!
!
!
!
line con 0
 exec-timeout 0 0
 privilege level 15
 logging synchronous
line aux 0
 exec-timeout 0 0
 privilege level 15
 logging synchronous
line vty 0 4
 login local
 transport input ssh
!
!
end

R1#show ip route
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is not set

     10.0.0.0/8 is variably subnetted, 3 subnets, 2 masks
C       10.10.10.0/24 is directly connected, FastEthernet0/0
O       10.10.20.0/24 [110/3] via 10.10.10.7, 00:43:58, FastEthernet0/0
O       10.10.30.0/30 [110/2] via 10.10.10.7, 00:43:58, FastEthernet0/0
R1#show ip ospf neighbor

Neighbor ID     Pri   State           Dead Time   Address         Interface
2.2.2.2           1   2WAY/DROTHER    00:00:38    10.10.10.2      FastEthernet0/0
3.3.3.3           1   2WAY/DROTHER    00:00:38    10.10.10.3      FastEthernet0/0
4.4.4.4           1   2WAY/DROTHER    00:00:38    10.10.10.4      FastEthernet0/0
5.5.5.5           1   FULL/BDR        00:00:39    10.10.10.5      FastEthernet0/0
6.6.6.6           1   FULL/DR         00:00:39    10.10.10.6      FastEthernet0/0
7.7.7.7           1   2WAY/DROTHER    00:00:38    10.10.10.7      FastEthernet0/0
R1#show ip interface brief
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            10.10.10.1      YES NVRAM  up                    up      
FastEthernet1/0            unassigned      YES NVRAM  up                    up      
FastEthernet2/0            unassigned      YES NVRAM  up                    up      
FastEthernet3/0            unassigned      YES NVRAM  ********istratively down down    
R1#
R1#exit
