Connected to Dynamips VM "R1" (ID 1, type c3600) - Console port
Press ENTER to get the prompt.
EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is not set

     10.0.0.0/24 is subnetted, 1 subnets
C       10.10.10.0 is directly connected, FastEthernet0/0
R1#
R1#show ip ospf neighbor

Neighbor ID     Pri   State           Dead Time   Address         Interface
2.2.2.2           1   2WAY/DROTHER    00:00:31    10.10.10.2      FastEthernet0/0
3.3.3.3           1   2WAY/DROTHER    00:00:31    10.10.10.3      FastEthernet0/0
10.10.10.4        1   2WAY/DROTHER    00:00:31    10.10.10.4      FastEthernet0/0
10.10.10.5        1   FULL/BDR        00:00:31    10.10.10.5      FastEthernet0/0
10.10.10.6        1   FULL/DR         00:00:39    10.10.10.6      FastEthernet0/0
R1#********
Translating "********"

Translating "********"
% Unknown command or computer name, or unable to find computer address
R1#
R1#terminal width 511
R1#terminal length 0
R1#
R1#
R1#show running-config
Building configuration...

Current configuration : 1273 bytes
!
version 12.4
service timestamps debug datetime msec
service timestamps log datetime msec
no service password-encryption
!
hostname R1
!
boot-start-marker
boot-end-marker
!
!
no aaa new-model
memory-size iomem 5
no ip icmp rate-limit unreachable
!
!
ip cef
no ip domain lookup
ip domain name lab.local
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
username ******** privilege 15 secret 5 $1$t4vg$eS99GV0XEQ14fa2Fzv9F7.
!
!
ip tcp synwait-time 5
ip ssh version 2
! 
!
!
!
!
interface FastEthernet0/0
 ip address 10.10.10.1 255.255.255.0
 duplex auto
 speed auto
!
interface FastEthernet1/0
 no ip address
 duplex auto
 speed auto
!
interface FastEthernet2/0
 no ip address
 duplex auto
 speed auto
!
interface FastEthernet3/0
 no ip address
 shutdown
 duplex auto
 speed auto
!
router ospf 1
 router-id 1.1.1.1
 log-adjacency-changes
 network 10.0.1.28 0.0.0.3 area 0
 network 10.0.1.32 0.0.0.3 area 0
 network 10.10.10.0 0.0.0.255 area 0
 network 10.10.20.0 0.0.0.255 area 0
!
no ip http server
no ip http secure-server
!
!
!
no cdp log mismatch duplex
!
!
!
control-plane
!
!
!
!
!
!
!
!
!
!
line con 0
 exec-timeout 0 0
 privilege level 15
 logging synchronous
line aux 0
 exec-timeout 0 0
 privilege level 15
 logging synchronous
line vty 0 4
 login local
 transport input ssh
!
!
end

R1#show ip route
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is not set

     10.0.0.0/24 is subnetted, 1 subnets
C       10.10.10.0 is directly connected, FastEthernet0/0
R1#show ip ospf neighbor

Neighbor ID     Pri   State           Dead Time   Address         Interface
2.2.2.2           1   2WAY/DROTHER    00:00:38    10.10.10.2      FastEthernet0/0
3.3.3.3           1   2WAY/DROTHER    00:00:38    10.10.10.3      FastEthernet0/0
10.10.10.4        1   2WAY/DROTHER    00:00:38    10.10.10.4      FastEthernet0/0
10.10.10.5        1   FULL/BDR        00:00:38    10.10.10.5      FastEthernet0/0
10.10.10.6        1   FULL/DR         00:00:38    10.10.10.6      FastEthernet0/0
R1#
R1#exit





























































R1 con0 is now available





Press RETURN to get started.





R1#
R1#terminal width 511
R1#terminal length 0
R1#
R1#
R1#terminal length 0
R1#terminal width 0
R1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#router ospf 1
R1(config-router)#router-id 1.1.1.1
R1(config-router)#network 10.10.10.0 0.0.0.255 area 0
R1(config-router)#end
R1#
*Mar  1 00:51:28.399: %SYS-5-CONFIG_I: Configured from console by console
R1#wr mem
Building configuration...
[OK]
R1#show clock
*00:51:37.151 UTC Fri Mar 1 2002
R1#show running-config
Building configuration...

Current configuration : 1273 bytes
!
version 12.4
service timestamps debug datetime msec
service timestamps log datetime msec
no service password-encryption
!
hostname R1
!
boot-start-marker
boot-end-marker
!
!
no aaa new-model
memory-size iomem 5
no ip icmp rate-limit unreachable
!
!
ip cef
no ip domain lookup
ip domain name lab.local
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
username ******** privilege 15 secret 5 $1$t4vg$eS99GV0XEQ14fa2Fzv9F7.
!
!
ip tcp synwait-time 5
ip ssh version 2
! 
!
!
!
!
interface FastEthernet0/0
 ip address 10.10.10.1 255.255.255.0
 duplex auto
 speed auto
!
interface FastEthernet1/0
 no ip address
 duplex auto
 speed auto
!
interface FastEthernet2/0
 no ip address
 duplex auto
 speed auto
!
interface FastEthernet3/0
 no ip address
 shutdown
 duplex auto
 speed auto
!
router ospf 1
 router-id 1.1.1.1
 log-adjacency-changes
 network 10.0.1.28 0.0.0.3 area 0
 network 10.0.1.32 0.0.0.3 area 0
 network 10.10.10.0 0.0.0.255 area 0
 network 10.10.20.0 0.0.0.255 area 0
!
no ip http server
no ip http secure-server
!
!
!
no cdp log mismatch duplex
!
!
!
control-plane
!
!
!
!
!
!
!
!
!
!
line con 0
 exec-timeout 0 0
 privilege level 15
 logging synchronous
line aux 0
 exec-timeout 0 0
 privilege level 15
 logging synchronous
line vty 0 4
 login local
 transport input ssh
!
!
end

R1#show ip route
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is not set

     10.0.0.0/24 is subnetted, 1 subnets
C       10.10.10.0 is directly connected, FastEthernet0/0
R1#show ip ospf neighbor

Neighbor ID     Pri   State           Dead Time   Address         Interface
2.2.2.2           1   2WAY/DROTHER    00:00:37    10.10.10.2      FastEthernet0/0
3.3.3.3           1   2WAY/DROTHER    00:00:37    10.10.10.3      FastEthernet0/0
10.10.10.4        1   2WAY/DROTHER    00:00:37    10.10.10.4      FastEthernet0/0
10.10.10.5        1   FULL/BDR        00:00:37    10.10.10.5      FastEthernet0/0
10.10.10.6        1   FULL/DR         00:00:37    10.10.10.6      FastEthernet0/0
R1#show ip interface brief
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            10.10.10.1      YES NVRAM  up                    up      
FastEthernet1/0            unassigned      YES NVRAM  up                    up      
FastEthernet2/0            unassigned      YES NVRAM  up                    up      
FastEthernet3/0            unassigned      YES NVRAM  ********istratively down down    
R1#
R1#exit
