Connected to Dynamips VM "R2" (ID 2, type c3600) - Console port
Press ENTER to get the prompt.
/0
5.5.5.5           1   FULL/BDR        00:00:31    10.10.10.5      FastEthernet0/0
6.6.6.6           1   FULL/DR         00:00:31    10.10.10.6      FastEthernet0/0
R2#show ip ospf neighbor

Neighbor ID     Pri   State           Dead Time   Address         Interface
1.1.1.1           1   2WAY/DROTHER    00:00:32    10.10.10.1      FastEthernet0/0
3.3.3.3           1   2WAY/DROTHER    00:00:32    10.10.10.3      FastEthernet0/0
4.4.4.4           1   2WAY/DROTHER    00:00:32    10.10.10.4      FastEthernet0/0
5.5.5.5           1   FULL/BDR        00:00:34    10.10.10.5      FastEthernet0/0
6.6.6.6           1   FULL/DR         00:00:33    10.10.10.6      FastEthernet0/0
7.7.7.7           1   2WAY/DROTHER    00:00:32    10.10.10.7      FastEthernet0/0
R2#
R2#terminal width 511
R2#terminal length 0
R2#
R2#
R2#
R2#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#
R2(config)#interface FastEthernet0/0
R2(config-if)#ip address 10.10.10.2 255.255.255.0
R2(config-if)#no shutdown
R2(config-if)#exit
R2(config)#
R2(config)#
R2(config)#router ospf 1
R2(config-router)#router-id 10.10.10.2
Reload or use "clear ip ospf process" command, for this to take effect
R2(config-router)#network 10.10.10.0 0.0.0.255 area 0
R2(config-router)#network 10.10.20.0 0.0.0.255 area 0
R2(config-router)#exit
R2(config)#
R2(config)#end
R2#
R2#
R2#
R2#write mem
Building configuration...
[OK]
R2#
R2#show running-config
Building configuration...

Current configuration : 1293 bytes
!
version 12.4
service timestamps debug datetime msec
service timestamps log datetime msec
no service password-encryption
!
hostname R2
!
boot-start-marker
boot-end-marker
!
!
no aaa new-model
memory-size iomem 5
no ip icmp rate-limit unreachable
!
!
ip cef
no ip domain lookup
ip domain name mgmt.local
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
username ******** privilege 15 secret 5 $1$PZIH$6264uS6VcBTmYCAf.M24t/
!
!
ip tcp synwait-time 5
ip ssh version 2
! 
!
!
!
!
interface FastEthernet0/0
 ip address 10.10.10.2 255.255.255.0
 duplex auto
 speed auto
!
interface FastEthernet1/0
 no ip address
 shutdown
 duplex auto
 speed auto
!
interface FastEthernet2/0
 no ip address
 duplex auto
 speed auto
!
interface FastEthernet3/0
 no ip address
 shutdown
 duplex auto
 speed auto
!
router ospf 1
 router-id 10.10.10.2
 log-adjacency-changes
 network 10.0.1.32 0.0.0.3 area 0
 network 10.10.10.0 0.0.
*Mar  1 01:21:39.775: %SYS-5-CONFIG_I: Configured from console by console0.255 area 0
 network 10.10.20.0 0.0.0.255 area 0
 network 192.168.10.0 0.0.0.255 area 10
!
no ip http server
no ip http secure-server
!
!
!
no cdp log mismatch duplex
!
!
!
control-plane
!
!
!
!
!
!
!
!
!
!
line con 0
 exec-timeout 0 0
 privilege level 15
 logging synchronous
line aux 0
 exec-timeout 0 0
 privilege level 15
 logging synchronous
line vty 0 4
 login local
 transport input ssh
!
!
end

R2#
R2#
R2#
R2#show ip ospf neighbor

Neighbor ID     Pri   State           Dead Time   Address         Interface
1.1.1.1           1   2WAY/DROTHER    00:00:37    10.10.10.1      FastEthernet0/0
3.3.3.3           1   2WAY/DROTHER    00:00:37    10.10.10.3      FastEthernet0/0
4.4.4.4           1   2WAY/DROTHER    00:00:37    10.10.10.4      FastEthernet0/0
5.5.5.5           1   FULL/BDR        00:00:38    10.10.10.5      FastEthernet0/0
6.6.6.6           1   FULL/DR         00:00:38    10.10.10.6      FastEthernet0/0
7.7.7.7           1   2WAY/DROTHER    00:00:37    10.10.10.7      FastEthernet0/0
R2#
R2#show ip route ospf
     10.0.0.0/8 is variably subnetted, 3 subnets, 2 masks
O       10.10.20.0/24 [110/3] via 10.10.10.7, 00:39:14, FastEthernet0/0
O       10.10.30.0/30 [110/2] via 10.10.10.7, 00:39:14, FastEthernet0/0
R2#
R2#exit





























































R2 con0 is now available





Press RETURN to get started.





R2#
R2#terminal width 511
R2#terminal length 0
R2#
R2#
R2#terminal length 0
R2#terminal width 0
R2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#router ospf 1
R2(config-router)#router-id 2.2.2.2
R2(config-router)#network 10.10.10.0 0.0.0.255 area 0
R2(config-router)#end
R2#
*Mar  1 01:27:01.463: %SYS-5-CONFIG_I: Configured from console by console
R2#wr mem
Building configuration...
[OK]
R2#show clock
*01:27:10.199 UTC Fri Mar 1 2002
R2#show running-config
Building configuration...
