Connected to Dynamips VM "R3" (ID 3, type c3600) - Console port
Press ENTER to get the prompt.
FastEthernet1/0, changed state to down
*Mar  1 00:00:05.187: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet2/0, changed state to up
*Mar  1 00:00:05.187: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet3/0, changed state to down
*Mar  1 00:00:05.235: %SYS-5-CONFIG_I: Configured from memory by console
*Mar  1 00:00:05.759: %SYS-5-RESTART: System restarted --
Cisco IOS Software, 3600 Software (C3640-JK9S-M), Version 12.4(16), RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2007 by Cisco Systems, Inc.
Compiled Wed 20-Jun-07 11:43 by prod_rel_team
*Mar  1 00:00:05.779: %SNMP-5-COLDSTART: SNMP agent on host R3 is undergoing a cold start
*Mar  1 00:00:06.995: %LINK-5-CHANGED: Interface FastEthernet1/0, changed state to ********istratively down
*Mar  1 00:00:07.043: %LINK-5-CHANGED: Interface FastEthernet3/0, changed state to ********istratively down
*Mar  1 00:00:45.959: %OSPF-5-ADJCHG: Process 1, Nbr 10.10.10.5 on FastEthernet0/0 from LOADING to FULL, Loading Done
*Mar  1 00:00:50.935: %OSPF-5-ADJCHG: Process 1, Nbr 10.10.10.6 on FastEthernet0/0 from LOADING to FULL, Loading Done
R3#
R3#terminal width 511
R3#terminal length 0
R3#
R3#
R3#show running-config
Building configuration...

Current configuration : 1290 bytes
!
version 12.4
service timestamps debug datetime msec
service timestamps log datetime msec
no service password-encryption
!
hostname R3
!
boot-start-marker
boot-end-marker
!
!
no aaa new-model
memory-size iomem 5
no ip icmp rate-limit unreachable
!
!
ip cef
no ip domain lookup
ip domain name mgmt.local
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
username ******** privilege 15 secret 5 $1$fox7$MgXhC6Y3Htxk7tldrUhqg.
!
!
ip tcp synwait-time 5
ip ssh version 2
! 
!
!
!
!
interface FastEthernet0/0
 ip address 10.10.10.3 255.255.255.0
 duplex auto
 speed auto
!
interface FastEthernet1/0
 no ip address
 shutdown
 duplex auto
 speed auto
!
interface FastEthernet2/0
 no ip address
 duplex auto
 speed auto
!
interface FastEthernet3/0
 no ip address
 shutdown
 duplex auto
 speed auto
!
router ospf 1
 router-id 3.3.3.3
 log-adjacency-changes
 network 10.0.1.28 0.0.0.3 area 0
 network 10.10.10.0 0.0.0.255 area 0
 network 10.10.20.0 0.0.0.255 area 0
 network 192.168.40.0 0.0.0.255 area 40
!
no ip http server
no ip http secure-server
!
!
!
no cdp log mismatch duplex
!
!
!
control-plane
!
!
!
!
!
!
!
!
!
!
line con 0
 exec-timeout 0 0
 privilege level 15
 logging synchronous
line aux 0
 exec-timeout 0 0
 privilege level 15
 logging synchronous
line vty 0 4
 login local
 transport input ssh
!
!
end

R3#show ip route
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is not set

     10.0.0.0/24 is subnetted, 1 subnets
C       10.10.10.0 is directly connected, FastEthernet0/0
R3#show ip ospf neighbor

Neighbor ID     Pri   State           Dead Time   Address         Interface
1.1.1.1           1   2WAY/DROTHER    00:00:32    10.10.10.1      FastEthernet0/0
2.2.2.2           1   2WAY/DROTHER    00:00:32    10.10.10.2      FastEthernet0/0
10.10.10.4        1   2WAY/DROTHER    00:00:32    10.10.10.4      FastEthernet0/0
10.10.10.5        1   FULL/BDR        00:00:32    10.10.10.5      FastEthernet0/0
10.10.10.6        1   FULL/DR         00:00:32    10.10.10.6      FastEthernet0/0
R3#
R3#exit





























































R3 con0 is now available





Press RETURN to get started.








R3#
R3#terminal width 511
R3#terminal length 0
R3#

R3#
R3#terminal length 0
R3#terminal width 0
R3#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R3(config)#router ospf 1
R3(config-router)#router-id 3.3.3.3
R3(config-router)#network 10.10.10.0 0.0.0.255 area 0
R3(config-router)#end
R3#
*Mar  1 00:52:59.855: %SYS-5-CONFIG_I: Configured from console by console
R3#wr mem
Building configuration...
[OK]
R3#show clock
*00:53:08.555 UTC Fri Mar 1 2002
R3#show running-config
Building configuration...

Current configuration : 1290 bytes
!
version 12.4
service timestamps debug datetime msec
service timestamps log datetime msec
no service password-encryption
!
hostname R3
!
boot-start-marker
boot-end-marker
!
!
no aaa new-model
memory-size iomem 5
no ip icmp rate-limit unreachable
!
!
ip cef
no ip domain lookup
ip domain name mgmt.local
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
username ******** privilege 15 secret 5 $1$fox7$MgXhC6Y3Htxk7tldrUhqg.
!
!
ip tcp synwait-time 5
ip ssh version 2
! 
!
!
!
!
interface FastEthernet0/0
 ip address 10.10.10.3 255.255.255.0
 duplex auto
 speed auto
!
interface FastEthernet1/0
 no ip address
 shutdown
 duplex auto
 speed auto
!
interface FastEthernet2/0
 no ip address
 duplex auto
 speed auto
!
interface FastEthernet3/0
 no ip address
 shutdown
 duplex auto
 speed auto
!
router ospf 1
 router-id 3.3.3.3
 log-adjacency-changes
 network 10.0.1.28 0.0.0.3 area 0
 network 10.10.10.0 0.0.0.255 area 0
 network 10.10.20.0 0.0.0.255 area 0
 network 192.168.40.0 0.0.0.255 area 40
!
no ip http server
no ip http secure-server
!
!
!
no cdp log mismatch duplex
!
!
!
control-plane
!
!
!
!
!
!
!
!
!
!
line con 0
 exec-timeout 0 0
 privilege level 15
 logging synchronous
line aux 0
 exec-timeout 0 0
 privilege level 15
 logging synchronous
line vty 0 4
 login local
 transport input ssh
!
!
end

R3#show ip route
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is not set

     10.0.0.0/24 is subnetted, 1 subnets
C       10.10.10.0 is directly connected, FastEthernet0/0
R3#show ip ospf neighbor

Neighbor ID     Pri   State           Dead Time   Address         Interface
1.1.1.1           1   2WAY/DROTHER    00:00:35    10.10.10.1      FastEthernet0/0
2.2.2.2           1   2WAY/DROTHER    00:00:35    10.10.10.2      FastEthernet0/0
10.10.10.4        1   2WAY/DROTHER    00:00:35    10.10.10.4      FastEthernet0/0
10.10.10.5        1   FULL/BDR        00:00:35    10.10.10.5      FastEthernet0/0
10.10.10.6        1   FULL/DR         00:00:35    10.10.10.6      FastEthernet0/0
R3#show ip interface brief
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            10.10.10.3      YES NVRAM  up                    up      
FastEthernet1/0            unassigned      YES NVRAM  ********istratively down down    
FastEthernet2/0            unassigned      YES NVRAM  up                    up      
FastEthernet3/0            unassigned      YES NVRAM  ********istratively down down    
R3#
R3#exit
