Connected to Dynamips VM "R5" (ID 5, type c3600) - Console port
Press ENTER to get the prompt.
START: SNMP agent on host R5 is undergoing a cold start
*Mar  1 00:00:05.207: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up
*Mar  1 00:00:05.207: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/0, changed state to down
*Mar  1 00:00:05.207: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet2/0, changed state to down
*Mar  1 00:00:05.211: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet3/0, changed state to down
*Mar  1 00:00:06.231: %LINK-5-CHANGED: Interface FastEthernet1/0, changed state to ********istratively down
*Mar  1 00:00:06.263: %LINK-5-CHANGED: Interface FastEthernet2/0, changed state to ********istratively down
*Mar  1 00:00:06.263: %LINK-5-CHANGED: Interface FastEthernet3/0, changed state to ********istratively down
*Mar  1 00:00:45.619: %OSPF-5-ADJCHG: Process 1, Nbr 10.10.10.4 on FastEthernet0/0 from LOADING to FULL, Loading Done
*Mar  1 00:00:45.623: %OSPF-5-ADJCHG: Process 1, Nbr 3.3.3.3 on FastEthernet0/0 from LOADING to FULL, Loading Done
*Mar  1 00:00:45.623: %OSPF-5-ADJCHG: Process 1, Nbr 1.1.1.1 on FastEthernet0/0 from LOADING to FULL, Loading Done
*Mar  1 00:00:45.623: %OSPF-5-ADJCHG: Process 1, Nbr 10.10.10.6 on FastEthernet0/0 from LOADING to FULL, Loading Done
*Mar  1 00:00:50.611: %OSPF-5-ADJCHG: Process 1, Nbr 2.2.2.2 on FastEthernet0/0 from LOADING to FULL, Loading Done
R5#
R5#terminal width 511
R5#terminal length 0
R5#
R5#
R5#show running-config
Building configuration...

Current configuration : 1069 bytes
!
version 12.4
service timestamps debug datetime msec
service timestamps log datetime msec
no service password-encryption
!
hostname R5
!
boot-start-marker
boot-end-marker
!
!
no aaa new-model
memory-size iomem 5
no ip icmp rate-limit unreachable
!
!
ip cef
no ip domain lookup
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
ip tcp synwait-time 5
! 
!
!
!
!
interface FastEthernet0/0
 ip address 10.10.10.5 255.255.255.0
 duplex auto
 speed auto
!
interface FastEthernet1/0
 no ip address
 shutdown
 duplex auto
 speed auto
!
interface FastEthernet2/0
 no ip address
 shutdown
 duplex auto
 speed auto
!
interface FastEthernet3/0
 no ip address
 shutdown
 duplex auto
 speed auto
!
router ospf 1
 log-adjacency-changes
 network 10.10.10.0 0.0.0.255 area 0
 network 10.10.20.0 0.0.0.255 area 0
!
no ip http server
no ip http secure-server
!
!
!
no cdp log mismatch duplex
!
!
!
control-plane
!
!
!
!
!
!
!
!
!
!
line con 0
 exec-timeout 0 0
 privilege level 15
 logging synchronous
line aux 0
 exec-timeout 0 0
 privilege level 15
 logging synchronous
line vty 0 4
 login
!
!
end

R5#show ip route
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is not set

     10.0.0.0/24 is subnetted, 1 subnets
C       10.10.10.0 is directly connected, FastEthernet0/0
R5#show ip ospf neighbor

Neighbor ID     Pri   State           Dead Time   Address         Interface
1.1.1.1           1   FULL/DROTHER    00:00:38    10.10.10.1      FastEthernet0/0
2.2.2.2           1   FULL/DROTHER    00:00:38    10.10.10.2      FastEthernet0/0
3.3.3.3           1   FULL/DROTHER    00:00:38    10.10.10.3      FastEthernet0/0
10.10.10.4        1   FULL/DROTHER    00:00:38    10.10.10.4      FastEthernet0/0
10.10.10.6        1   FULL/DR         00:00:38    10.10.10.6      FastEthernet0/0
R5#
R5#exit





























































R5 con0 is now available





Press RETURN to get started.








R5#
R5#terminal width 511
R5#terminal length 0
R5#
R5#
R5#terminal length 0
R5#terminal width 0
R5#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R5(config)#router ospf 1
R5(config-router)#router-id 5.5.5.5
Reload or use "clear ip ospf process" command, for this to take effect
R5(config-router)#network 10.10.10.0 0.0.0.255 area 0
R5(config-router)#end
R5#
*Mar  1 00:54:31.695: %SYS-5-CONFIG_I: Configured from console by console
R5#wr mem
Building configuration...
[OK]
R5#show clock
*00:54:40.311 UTC Fri Mar 1 2002
R5#show running-config
Building configuration...

Current configuration : 1088 bytes
!
version 12.4
service timestamps debug datetime msec
service timestamps log datetime msec
no service password-encryption
!
hostname R5
!
boot-start-marker
boot-end-marker
!
!
no aaa new-model
memory-size iomem 5
no ip icmp rate-limit unreachable
!
!
ip cef
no ip domain lookup
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
ip tcp synwait-time 5
! 
!
!
!
!
interface FastEthernet0/0
 ip address 10.10.10.5 255.255.255.0
 duplex auto
 speed auto
!
interface FastEthernet1/0
 no ip address
 shutdown
 duplex auto
 speed auto
!
interface FastEthernet2/0
 no ip address
 shutdown
 duplex auto
 speed auto
!
interface FastEthernet3/0
 no ip address
 shutdown
 duplex auto
 speed auto
!
router ospf 1
 router-id 5.5.5.5
 log-adjacency-changes
 network 10.10.10.0 0.0.0.255 area 0
 network 10.10.20.0 0.0.0.255 area 0
!
no ip http server
no ip http secure-server
!
!
!
no cdp log mismatch duplex
!
!
!
control-plane
!
!
!
!
!
!
!
!
!
!
line con 0
 exec-timeout 0 0
 privilege level 15
 logging synchronous
line aux 0
 exec-timeout 0 0
 privilege level 15
 logging synchronous
line vty 0 4
 login
!
!
end

R5#show ip route
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is not set

     10.0.0.0/24 is subnetted, 1 subnets
C       10.10.10.0 is directly connected, FastEthernet0/0
R5#show ip ospf neighbor

Neighbor ID     Pri   State           Dead Time   Address         Interface
1.1.1.1           1   FULL/DROTHER    00:00:34    10.10.10.1      FastEthernet0/0
2.2.2.2           1   FULL/DROTHER    00:00:34    10.10.10.2      FastEthernet0/0
3.3.3.3           1   FULL/DROTHER    00:00:34    10.10.10.3      FastEthernet0/0
10.10.10.4        1   FULL/DROTHER    00:00:34    10.10.10.4      FastEthernet0/0
10.10.10.6        1   FULL/DR         00:00:34    10.10.10.6      FastEthernet0/0
R5#show ip interface brief
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            10.10.10.5      YES NVRAM  up                    up      
FastEthernet1/0            unassigned      YES NVRAM  ********istratively down down    
FastEthernet2/0            unassigned      YES NVRAM  ********istratively down down    
FastEthernet3/0            unassigned      YES NVRAM  ********istratively down down    
R5#
R5#exit
