Connected to Dynamips VM "R9" (ID 9, type c3600) - Console port
Press ENTER to get the prompt.
et3/0, changed state to up
*Mar  1 00:00:04.431: %SYS-5-CONFIG_I: Configured from memory by console
*Mar  1 00:00:04.647: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up
*Mar  1 00:00:04.647: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet1/0, changed state to down
*Mar  1 00:00:04.911: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet2/0, changed state to down
*Mar  1 00:00:04.911: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet3/0, changed state to down
*Mar  1 00:00:05.191: %SYS-5-RESTART: System restarted --
Cisco IOS Software, 3600 Software (C3640-JK9S-M), Version 12.4(16), RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2007 by Cisco Systems, Inc.
Compiled Wed 20-Jun-07 11:43 by prod_rel_team
*Mar  1 00:00:05.223: %SNMP-5-COLDSTART: SNMP agent on host R9 is undergoing a cold start
*Mar  1 00:00:06.263: %LINK-5-CHANGED: Interface FastEthernet1/0, changed state to ********istratively down
*Mar  1 00:00:06.287: %LINK-5-CHANGED: Interface FastEthernet2/0, changed state to ********istratively down
*Mar  1 00:00:06.299: %LINK-5-CHANGED: Interface FastEthernet3/0, changed state to ********istratively down
*Mar  1 00:00:49.375: %OSPF-5-ADJCHG: Process 1, Nbr 14.14.14.14 on FastEthernet0/0 from LOADING to FULL, Loading Done
*Mar  1 00:00:49.391: %OSPF-5-ADJCHG: Process 1, Nbr 13.13.13.13 on FastEthernet0/0 from LOADING to FULL, Loading Done
R9#
R9#terminal width 511
R9#terminal length 0
R9#
R9#
R9#show running-config
Building configuration...

Current configuration : 1069 bytes
!
version 12.4
service timestamps debug datetime msec
service timestamps log datetime msec
no service password-encryption
!
hostname R9
!
boot-start-marker
boot-end-marker
!
!
no aaa new-model
memory-size iomem 5
no ip icmp rate-limit unreachable
!
!
ip cef
no ip domain lookup
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
ip tcp synwait-time 5
! 
!
!
!
!
interface FastEthernet0/0
 ip address 10.10.20.9 255.255.255.0
 duplex auto
 speed auto
!
interface FastEthernet1/0
 no ip address
 shutdown
 duplex auto
 speed auto
!
interface FastEthernet2/0
 no ip address
 shutdown
 duplex auto
 speed auto
!
interface FastEthernet3/0
 no ip address
 shutdown
 duplex auto
 speed auto
!
router ospf 1
 log-adjacency-changes
 network 10.10.10.0 0.0.0.255 area 0
 network 10.10.20.0 0.0.0.255 area 0
!
no ip http server
no ip http secure-server
!
!
!
no cdp log mismatch duplex
!
!
!
control-plane
!
!
!
!
!
!
!
!
!
!
line con 0
 exec-timeout 0 0
 privilege level 15
 logging synchronous
line aux 0
 exec-timeout 0 0
 privilege level 15
 logging synchronous
line vty 0 4
 login
!
!
end

R9#show ip route
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is not set

     10.0.0.0/24 is subnetted, 1 subnets
C       10.10.20.0 is directly connected, FastEthernet0/0
R9#show ip ospf neighbor

Neighbor ID     Pri   State           Dead Time   Address         Interface
11.11.11.11       1   2WAY/DROTHER    00:00:33    10.10.20.11     FastEthernet0/0
12.12.12.12       1   2WAY/DROTHER    00:00:35    10.10.20.12     FastEthernet0/0
13.13.13.13       1   FULL/BDR        00:00:36    10.10.20.13     FastEthernet0/0
14.14.14.14       1   FULL/DR         00:00:38    10.10.20.14     FastEthernet0/0
R9#
R9#exit





























































R9 con0 is now available





Press RETURN to get started.





R9#
R9#terminal width 511
R9#terminal length 0
R9#
R9#
R9#terminal length 0
R9#terminal width 0
R9#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
R9(config)#router ospf 1
R9(config-router)#router-id 9.9.9.9
Reload or use "clear ip ospf process" command, for this to take effect
R9(config-router)#network 10.10.20.0 0.0.0.255 area 0
R9(config-router)#end
R9#
*Mar  1 00:56:02.283: %SYS-5-CONFIG_I: Configured from console by console
R9#wr mem
Building configuration...
[OK]
R9#show clock
*00:56:10.991 UTC Fri Mar 1 2002
R9#show running-config
Building configuration...

Current configuration : 1088 bytes
!
version 12.4
service timestamps debug datetime msec
service timestamps log datetime msec
no service password-encryption
!
hostname R9
!
boot-start-marker
boot-end-marker
!
!
no aaa new-model
memory-size iomem 5
no ip icmp rate-limit unreachable
!
!
ip cef
no ip domain lookup
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
!
ip tcp synwait-time 5
! 
!
!
!
!
interface FastEthernet0/0
 ip address 10.10.20.9 255.255.255.0
 duplex auto
 speed auto
!
interface FastEthernet1/0
 no ip address
 shutdown
 duplex auto
 speed auto
!
interface FastEthernet2/0
 no ip address
 shutdown
 duplex auto
 speed auto
!
interface FastEthernet3/0
 no ip address
 shutdown
 duplex auto
 speed auto
!
router ospf 1
 router-id 9.9.9.9
 log-adjacency-changes
 network 10.10.10.0 0.0.0.255 area 0
 network 10.10.20.0 0.0.0.255 area 0
!
no ip http server
no ip http secure-server
!
!
!
no cdp log mismatch duplex
!
!
!
control-plane
!
!
!
!
!
!
!
!
!
!
line con 0
 exec-timeout 0 0
 privilege level 15
 logging synchronous
line aux 0
 exec-timeout 0 0
 privilege level 15
 logging synchronous
line vty 0 4
 login
!
!
end

R9#show ip route
Codes: C - connected, S - static, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area 
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2
       i - IS-IS, su - IS-IS summary, L1 - IS-IS level-1, L2 - IS-IS level-2
       ia - IS-IS inter area, * - candidate default, U - per-user static route
       o - ODR, P - periodic downloaded static route

Gateway of last resort is not set

     10.0.0.0/24 is subnetted, 1 subnets
C       10.10.20.0 is directly connected, FastEthernet0/0
R9#show ip ospf neighbor

Neighbor ID     Pri   State           Dead Time   Address         Interface
11.11.11.11       1   2WAY/DROTHER    00:00:33    10.10.20.11     FastEthernet0/0
12.12.12.12       1   2WAY/DROTHER    00:00:35    10.10.20.12     FastEthernet0/0
13.13.13.13       1   FULL/BDR        00:00:36    10.10.20.13     FastEthernet0/0
14.14.14.14       1   FULL/DR         00:00:37    10.10.20.14     FastEthernet0/0
R9#show ip interface brief
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            10.10.20.9      YES NVRAM  up                    up      
FastEthernet1/0            unassigned      YES NVRAM  ********istratively down down    
FastEthernet2/0            unassigned      YES NVRAM  ********istratively down down    

FastEthernet3/0            unassigned      YES NVRAM  ********istratively down down    
R9#
R9#exit
